## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_application_insights.app_insights will be created
  + resource "azurerm_application_insights" "app_insights" {
      + app_id                                = (known after apply)
      + application_type                      = "web"
      + connection_string                     = (sensitive value)
      + daily_data_cap_in_gb                  = (known after apply)
      + daily_data_cap_notifications_disabled = (known after apply)
      + disable_ip_masking                    = false
      + force_customer_storage_for_profiler   = false
      + id                                    = (known after apply)
      + instrumentation_key                   = (sensitive value)
      + internet_ingestion_enabled            = true
      + internet_query_enabled                = true
      + local_authentication_disabled         = false
      + location                              = "northeurope"
      + name                                  = "production-o-result-app-insights"
      + resource_group_name                   = "production-o-result"
      + retention_in_days                     = 90
      + sampling_percentage                   = 100
      + tags                                  = {
          + "environment" = "production"
        }
    }

  # azurerm_key_vault.vault will be created
  + resource "azurerm_key_vault" "vault" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = false
      + enabled_for_deployment          = false
      + enabled_for_disk_encryption     = false
      + enabled_for_template_deployment = false
      + id                              = (known after apply)
      + location                        = "northeurope"
      + name                            = "production-vault"
      + public_network_access_enabled   = true
      + purge_protection_enabled        = false
      + resource_group_name             = "production-o-result"
      + sku_name                        = "standard"
      + soft_delete_retention_days      = 7
      + tenant_id                       = "e3eee819-4d6a-43f6-8be9-84dddf3e92ce"
      + vault_uri                       = (known after apply)
    }

  # azurerm_key_vault_access_policy.function_app_access_policy will be created
  + resource "azurerm_key_vault_access_policy" "function_app_access_policy" {
      + id                 = (known after apply)
      + key_vault_id       = (known after apply)
      + object_id          = (known after apply)
      + secret_permissions = [
          + "Get",
        ]
      + tenant_id          = "e3eee819-4d6a-43f6-8be9-84dddf3e92ce"
    }

  # azurerm_key_vault_access_policy.service_principal_access_policy will be created
  + resource "azurerm_key_vault_access_policy" "service_principal_access_policy" {
      + id                 = (known after apply)
      + key_permissions    = [
          + "Create",
          + "Get",
          + "Delete",
          + "List",
          + "WrapKey",
          + "UnwrapKey",
          + "Encrypt",
          + "Decrypt",
          + "Purge",
          + "Recover",
        ]
      + key_vault_id       = (known after apply)
      + object_id          = "b8d41c11-1cbc-47bc-b1d5-9eb6087b0668"
      + secret_permissions = [
          + "Get",
          + "Set",
          + "Purge",
          + "Delete",
          + "Recover",
          + "Backup",
          + "Restore",
        ]
      + tenant_id          = "e3eee819-4d6a-43f6-8be9-84dddf3e92ce"
    }

  # azurerm_key_vault_secret.jwt_secret will be created
  + resource "azurerm_key_vault_secret" "jwt_secret" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "o-result-identity-jwt-secret"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.o_service_secret will be created
  + resource "azurerm_key_vault_secret" "o_service_secret" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "o-result-identity-oservice-secret"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_linux_function_app.funtion_app will be created
  + resource "azurerm_linux_function_app" "funtion_app" {
      + app_settings                      = (known after apply)
      + builtin_logging_enabled           = true
      + client_certificate_enabled        = false
      + client_certificate_mode           = "Optional"
      + content_share_force_disabled      = false
      + custom_domain_verification_id     = (sensitive value)
      + daily_memory_time_quota           = 0
      + default_hostname                  = (known after apply)
      + enabled                           = true
      + functions_extension_version       = "~4"
      + hosting_environment_id            = (known after apply)
      + https_only                        = false
      + id                                = (known after apply)
      + key_vault_reference_identity_id   = (known after apply)
      + kind                              = (known after apply)
      + location                          = "northeurope"
      + name                              = "production-o-result-function-app"
      + outbound_ip_address_list          = (known after apply)
      + outbound_ip_addresses             = (known after apply)
      + possible_outbound_ip_address_list = (known after apply)
      + possible_outbound_ip_addresses    = (known after apply)
      + public_network_access_enabled     = true
      + resource_group_name               = "production-o-result"
      + service_plan_id                   = (known after apply)
      + site_credential                   = (sensitive value)
      + storage_account_access_key        = (sensitive value)
      + storage_account_name              = "productionoresultstorage"
      + storage_uses_managed_identity     = false
      + tags                              = {
          + "environment" = "production"
        }
      + zip_deploy_file                   = (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + site_config {
          + always_on                               = (known after apply)
          + app_scale_limit                         = (known after apply)
          + application_insights_connection_string  = (sensitive value)
          + application_insights_key                = (sensitive value)
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + elastic_instance_minimum                = (known after apply)
          + ftps_state                              = "Disabled"
          + health_check_eviction_time_in_min       = (known after apply)
          + http2_enabled                           = false
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + pre_warmed_instance_count               = (known after apply)
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = false
          + vnet_route_all_enabled                  = false
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)

          + application_stack {
              + dotnet_version              = "7.0"
              + use_dotnet_isolated_runtime = true
            }

          + cors {
              + allowed_origins     = [
                  + "http://localhost:3000",
                ]
              + support_credentials = false
            }
        }
    }

  # azurerm_service_plan.service_plan will be created
  + resource "azurerm_service_plan" "service_plan" {
      + id                           = (known after apply)
      + kind                         = (known after apply)
      + location                     = "northeurope"
      + maximum_elastic_worker_count = (known after apply)
      + name                         = "production-o-result-service-plan"
      + os_type                      = "Linux"
      + per_site_scaling_enabled     = false
      + reserved                     = (known after apply)
      + resource_group_name          = "production-o-result"
      + sku_name                     = "Y1"
      + tags                         = {
          + "environment" = "production"
        }
      + worker_count                 = (known after apply)
    }

  # azurerm_storage_account.storage will be created
  + resource "azurerm_storage_account" "storage" {
      + access_tier                       = (known after apply)
      + account_kind                      = "StorageV2"
      + account_replication_type          = "LRS"
      + account_tier                      = "Standard"
      + allow_nested_items_to_be_public   = true
      + cross_tenant_replication_enabled  = true
      + default_to_oauth_authentication   = false
      + enable_https_traffic_only         = true
      + id                                = (known after apply)
      + infrastructure_encryption_enabled = false
      + is_hns_enabled                    = false
      + large_file_share_enabled          = (known after apply)
      + location                          = "northeurope"
      + min_tls_version                   = "TLS1_2"
      + name                              = "productionoresultstorage"
      + nfsv3_enabled                     = false
      + primary_access_key                = (sensitive value)
      + primary_blob_connection_string    = (sensitive value)
      + primary_blob_endpoint             = (known after apply)
      + primary_blob_host                 = (known after apply)
      + primary_connection_string         = (sensitive value)
      + primary_dfs_endpoint              = (known after apply)
      + primary_dfs_host                  = (known after apply)
      + primary_file_endpoint             = (known after apply)
      + primary_file_host                 = (known after apply)
      + primary_location                  = (known after apply)
      + primary_queue_endpoint            = (known after apply)
      + primary_queue_host                = (known after apply)
      + primary_table_endpoint            = (known after apply)
      + primary_table_host                = (known after apply)
      + primary_web_endpoint              = (known after apply)
      + primary_web_host                  = (known after apply)
      + public_network_access_enabled     = true
      + queue_encryption_key_type         = "Service"
      + resource_group_name               = "production-o-result"
      + secondary_access_key              = (sensitive value)
      + secondary_blob_connection_string  = (sensitive value)
      + secondary_blob_endpoint           = (known after apply)
      + secondary_blob_host               = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_dfs_endpoint            = (known after apply)
      + secondary_dfs_host                = (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      + secondary_location                = (known after apply)
      + secondary_queue_endpoint          = (known after apply)
      + secondary_queue_host              = (known after apply)
      + secondary_table_endpoint          = (known after apply)
      + secondary_table_host              = (known after apply)
      + secondary_web_endpoint            = (known after apply)
      + secondary_web_host                = (known after apply)
      + sftp_enabled                      = false
      + shared_access_key_enabled         = true
      + table_encryption_key_type         = "Service"
      + tags                              = {
          + "environment" = "production"
        }

      + network_rules {
          + bypass                     = [
              + "AzureServices",
            ]
          + default_action             = "Allow"
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)
        }
    }

  # azurerm_storage_table.o_service_calender_events_table will be created
  + resource "azurerm_storage_table" "o_service_calender_events_table" {
      + id                   = (known after apply)
      + name                 = "oServiceCalenderEvents"
      + storage_account_name = "productionoresultstorage"
    }

  # azurerm_storage_table.system_user_table will be created
  + resource "azurerm_storage_table" "system_user_table" {
      + id                   = (known after apply)
      + name                 = "systemUsers"
      + storage_account_name = "productionoresultstorage"
    }

  # random_string.jwt_secret will be created
  + resource "random_string" "jwt_secret" {
      + id          = (known after apply)
      + length      = 50
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = true
      + upper       = true
    }

Plan: 12 to add, 0 to change, 0 to destroy.
```
</details>